STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_MultiBoard/STM32_WPAN/App/app_thread.c
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/**
 * @brief  Task associated to the push button.
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendCoapMsg(void)
{
  APP_THREAD_SendNextbuffer();
}


/**
 * @brief Thread initialization.
 *        This function configures the Thread mesh network.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;

  /* Configure the standard values */
  error = otInstanceErasePersistentInfo(NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
  }
  otInstanceFinalize(NULL);
  otInstanceInitSingle();
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
  }
  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
  }
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
  }
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE,error);
  }
  /* Start the COAP server */
  error = otCoapStart(NULL, OT_DEFAULT_COAP_PORT);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_START,error);
  }
  /* Add COAP resources */
  error = otCoapAddResource(NULL, &OT_Ressource);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,error);
  }
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START,error);
  }
}


/**
 * @brief Dummy request handler
 * @param
 * @retval None
 */
static void APP_THREAD_DummyReqHandler(void                * p_context,
    otCoapHeader        * pHeader,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo)
{
}

/**
 * @brief Thread notification when the state changes.
 *        When the Thread device changes state, a specific LED
 *        color is being displayed.
 *        LED2 On (Green) means that the device is in "Leader" mode.
 *        LED3 On (Red) means that the device is in "Child" mode or
 *         in "Router" mode.
 *        LED2 and LED3 off means that the device is in "Disabled"
 *         or "Detached" mode.
 *
 * @param  aFlags: Defines the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
  UNUSED(pContext);
  if ((NotifFlags & (uint32_t)OT_CHANGED_THREAD_ROLE) == (uint32_t)OT_CHANGED_THREAD_ROLE)
  {
    switch (otThreadGetDeviceRole(NULL))
    {
    case OT_DEVICE_ROLE_DISABLED:
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      break;
    case OT_DEVICE_ROLE_DETACHED:
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      break;
    case OT_DEVICE_ROLE_CHILD:
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      break;
    case OT_DEVICE_ROLE_ROUTER :
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      break;
    case OT_DEVICE_ROLE_LEADER :
      BSP_LED_On(LED2);
      BSP_LED_Off(LED3);
      break;
    default:
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      break;
    }
  }
}

/**
 * @brief  This function compute the next message to be send
 *         1-> 2 -> 3 ->...nbBoardConnected -> 1 -> 2 -> 3 ->..
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendNextbuffer(void)
{
  /* Send the data in unicast mode */

  if (IdBoard == NbBoardConnected)
  {
    APP_THREAD_SendCoapUnicastRequest(1U);
  }
  else
  {
    APP_THREAD_SendCoapUnicastRequest((IdBoard + 1U));
  }
}

/**
 * @brief This function is used to send the data via a Coap message in
 *        confirmable mode and unicast mode.
 *
 * @param device_receiver: Id of the device which is supposed to receive the Coap
 *                         message.
 * @retval None
 */
static void APP_THREAD_SendCoapUnicastRequest(uint8_t device_receiver)
{
  otError   error = OT_ERROR_NONE;

  APP_DBG_MSG(" ********* APP_THREAD_SendCoapUnicastRequest to Board nb %d \r\n",device_receiver);

  otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_CONFIRMABLE, OT_COAP_CODE_PUT);
  otCoapHeaderGenerateToken(&OT_Header, 2);
  error = otCoapHeaderAppendUriPathOptions(&OT_Header,C_RESSOURCE);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_APEND_URI,error);
  }
  otCoapHeaderSetPayloadMarker(&OT_Header);
  pOT_Message = otCoapNewMessage(NULL, &OT_Header);
  if (pOT_Message == NULL)
  {
    APP_THREAD_Error(ERR_ALLOC_MSG,error);
  }
  error = otMessageAppend(pOT_Message, &OT_Command, sizeof(OT_Command));
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
  }

  memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
  OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
  OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;
  error =  otIp6AddressFromString(OT_IpAdressAllocated[(device_receiver - 1U) ], &OT_MessageInfo.mPeerAddr);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_ALLOC_MSG,error);
  }

  error = otCoapSendRequest(NULL,
      pOT_Message,
      &OT_MessageInfo,
      &APP_THREAD_DummyRespHandler,
      (void*)&APP_THREAD_CoapRespHandler);

  if (error != OT_ERROR_NONE && pOT_Message != NULL)
  {
    APP_THREAD_Error(ERR_SEND_REQUEST,error);
    otMessageFree(pOT_Message);
  }
}

/**
 * @brief Data request handler triggered at the reception of the COAP message
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_CoapRequestHandler(otCoapHeader        * pHeader,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo)
{
  APP_DBG_MSG(" ********* APP_THREAD_CoapRequestHandler \r\n");
  do
  {
    if (otCoapHeaderGetCode(pHeader) != OT_COAP_CODE_PUT)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,0);
      break;
    }

