STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_MultiBoard/STM32_WPAN/App/app_thread.c
    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U)
    {
      APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
    }

    if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE)
    {
      APP_THREAD_DataRespSend(pHeader, pMessageInfo);
      APP_DBG_MSG(" ********* APP_THREAD_DataRespSend \r\n");
    }
    else
    {
      APP_THREAD_Error(ERR_THREAD_GET_HEADER, 0);
    }
  } while (false);
}

/**
 * @brief This function acknowledges the data reception by sending an ACK
 *        back to the sender.
 * @param  pRequestHeader coap header
 * @param  pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_DataRespSend(otCoapHeader        * pRequestHeader,
    const otMessageInfo * pMessageInfo)
{
  otError error = OT_ERROR_NONE;

  APP_DBG_MSG(" ********* APP_THREAD_DataRespSend\r\n");
  otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CHANGED);
  otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
  otCoapHeaderSetToken(&OT_Header,
      otCoapHeaderGetToken(pRequestHeader),
      otCoapHeaderGetTokenLength(pRequestHeader));

  pOT_Message = otCoapNewMessage(NULL, &OT_Header);
  if (pOT_Message == NULL)
  {
    APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
  }

  error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
  if (error != OT_ERROR_NONE && pOT_Message != NULL)
  {
    otMessageFree(pOT_Message);
    APP_THREAD_Error(ERR_THREAD_DATA_RESPONSE,error);
  }

  /* Warn the user of the reception of a COAP request */
  APP_DBG_MSG(" ********* Schedule the task TASK_Notif_CoapReceived\r\n");
  SCH_SetTask(TASK_Notif_CoapReceived,CFG_SCH_PRIO_1);
}

/**
 * @brief  This function is used to identify the board and
 *         associate a specific IP address.
 *         If the user presses one time on the SW3 button of the Nucleo board,
 *         this board will have the ID number 1
 *         If the user presses two times on the SW3 button of the Nucleo board,
 *         this board will have the ID number 2
 *         If the user presses N times on the SW3 button of the Nucleo board,
 *         this board will have the ID number N.
 *
 * @param  Mess: Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_IdentifyBoard()
{
  int  i;

  if (IdBoard < C_NB_BOARD_MAX)
  {
    /* Remove the previous Ip address registered */
    if (IdBoard != 0)
      APP_THREAD_AllocateUnicastIpAddr(IdBoard, FALSE);
    IdBoard ++;

    for (i = 0; i< IdBoard; i++)
    {
      BSP_LED_On(LED1);
      HAL_Delay(200U);
      BSP_LED_Off(LED1);
      HAL_Delay(200U);
    }
    if (otThreadGetDeviceRole(NULL) == OT_DEVICE_ROLE_LEADER)
    {
      NbBoardConnected = IdBoard;
    }
    /* Add the new Ip Address registered  */
    APP_THREAD_AllocateUnicastIpAddr(IdBoard, TRUE);
  }
}

/**
 * @brief This function is used to allocate the unicast Ip address to a dedicated
 *        board.
 *
 * @param boardId : Board identifier
 * @param flagNewIpAdd : Set to TRUE, in order to allocate a new Ip address to a board.
 *               Set to FALSE, in order to remove a previously allocated Ip address to a
 *               board.
 * @retval None
 */
static void APP_THREAD_AllocateUnicastIpAddr(uint8_t boardId, uint8_t flagNewIpAdd)
{
  /* Prepare the IPV6 address */

  if (boardId > C_NB_BOARD_MAX)
  {
    APP_THREAD_Error(ERR_THREAD_IP_ADDR_ALLOC, 0);
  }

  if (otIp6AddressFromString(OT_IpAdressAllocated[(boardId - 1U)], &OT_NetIfAddress.mAddress) != OT_ERROR_NONE)
    APP_THREAD_Error(ERR_THREAD_IP_ADDR_CONVERT, 0);

  if (flagNewIpAdd == TRUE)
  {
    OT_NetIfAddress.mPrefixLength = 64U;
    OT_NetIfAddress.mPreferred=true;
    OT_NetIfAddress.mValid=true;

    APP_DBG_MSG(" ********* Allocate_Specific_IpAdress = %s \r\n",OT_IpAdressAllocated[(boardId-1)]);
    /* Add the IP address to the list */
    if (otIp6AddUnicastAddress(NULL,&OT_NetIfAddress) != OT_ERROR_NONE)
      APP_THREAD_Error(ERR_THREAD_ADD_UNICAST, 0);
  }
  else
  {
    /* It may happen that this function returns an error, because the IpddAddr doesn't exist */
    otIp6RemoveUnicastAddress(NULL,&OT_NetIfAddress.mAddress);
  }
}

/**
 * @brief This function manages the data response handler
 *        and reschedules the sending of data.
 *
 * @param pHeader  header
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param Result
 * @retval None
 */
static void APP_THREAD_CoapRespHandler(otCoapHeader        * pHeader,
    otMessage       * pMessage,
    const otMessageInfo * pMessageInfo,
    otError         Result)
{
  if (Result == OT_ERROR_NONE)
    APP_DBG_MSG(" ********* The COAP has been well acknowledged with error = %d\r\n", Result);
  else
    APP_THREAD_Error(ERR_THREAD_RESPONSE_HANDLER, Result);
}

/**
 * @brief This function is used to set the EndDevice mode
 *
 * @param None
 * @retval None
 */
static void APP_THREAD_DummyRespHandler(void                * p_context,
    otCoapHeader        * pHeader,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo,
    otError             Result)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(p_context);
  UNUSED(pHeader);
  UNUSED(pMessage);
  UNUSED(pMessageInfo);
  UNUSED(Result);
}

/**
 * @brief  Warn the user that a COAP request has been
 *         received
 *
 * @param  Mess: Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_NotifCoapMsgReceived()
{
  /* Toggle the LED 1 */
  BSP_LED_On(LED1);
  HAL_Delay(500U);
  BSP_LED_Off(LED1);
  HAL_Delay(500U);
  BSP_LED_On(LED1);
  HAL_Delay(500U);
  BSP_LED_Off(LED1);
  HAL_Delay(500U);

  /* Schedule the next COAP.. */
  HAL_Delay(2000U);
  SCH_SetTask(TASK_SEND_BUFFER,CFG_SCH_PRIO_1);
}

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *         the LEDs on the Board will start blinking.
 *
 * @param  Mess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode)
{
  APP_DBG("**** Fatal error = %s (Err = %d)",pMess,ErrCode);
  while(1U == 1U)
  {
    BSP_LED_Toggle(LED1);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED2);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED3);
    HAL_Delay(500U);
  }
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated informations
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void)
{
  WirelessFwInfo_t wireless_info_instance;
  WirelessFwInfo_t* p_wireless_info = &wireless_info_instance;

